Revit 2027 API
BuiltInFailures.ImageFailures.InvalidHeight Property
 The image height must be must be no more than 30000 feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidHeight { get; }
Public Shared ReadOnly Property InvalidHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidHeight {
	FailureDefinitionId^ get ();
}
static member InvalidHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImageFailures Class
Autodesk.Revit.DB Namespace